>>> a = [66.25, 333, 333, 1, 1234.5]
>>> print(a.count(333), a.count(66.25), a.count('x')) # 计算列表中元素个数
2 1 0
>>> a.insert(2, -1)                                   # 在a中2号位插入元素-1
>>> a.append(333)                                     # 将333插入到a的末尾
>>> a
[66.25, 333, -1, 333, 1, 1234.5, 333]
>>> a.index(333)                                      # 获得元素的索引
1
>>> a.remove(333)                                     # 移除指定元素333
>>> a
[66.25, -1, 333, 1, 1234.5, 333]
>>> a.reverse()                                       # 将a中元素反向
>>> a
[333, 1234.5, 1, 333, -1, 66.25]
>>> a.sort()                                          # 对a中元素排序
>>> a
[-1, 1, 66.25, 333, 333, 1234.5]
>>> a.pop()                                           # 移除a中最后一个元素
1234.5
>>> a
[-1, 1, 66.25, 333, 333]